Revit 2027 API
IFCOpeningDimensions.GetOpeningHandle Method
 Gets the IFC opening element handle.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAnyHandle GetOpeningHandle()
Public Function GetOpeningHandle As IFCAnyHandle
public:
IFCAnyHandle^ GetOpeningHandle()
member GetOpeningHandle : unit -> IFCAnyHandle
Return Value
IFCAnyHandle
 The handle.
See Also
Reference
IFCOpeningDimensions Class
Autodesk.Revit.DB.IFC Namespace